app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 17 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 19 ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 19 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `name` = 'viviv', `surname` = '', `encrypted_password` = '$2a$11$Zcl/zufXqcylTE6IGL8v.OeGEPfNcNOnj/luVNLzO7/ccPy6A9Rk2', `updated_at` = '2018-03-22 09:44:53' WHERE `users`.`id` = 19
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 22 ORDER BY `users`.`id` ASC LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 8
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy